package com.example.base.model.bean;

import java.util.List;

/**
 * <p>文件描述：<p>
 * <p>作者：liudada<p>
 * <p>创建时间：2019/7/12<p>
 */
public class SreachBean {

    /**
     * result : [{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1556985600000,"sickCircleId":7,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1556985600000,"sickCircleId":8,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":6,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":5,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":9,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":10,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":11,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":12,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":13,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":14,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":15,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"详初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":16,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":17,"title":"急寻：面神经炎的治疗方法"},{"amount":10,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":18,"title":"急寻：面神经炎的治疗方法"},{"amount":0,"detail":"初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象","releaseTime":1555948800000,"sickCircleId":4,"title":"急寻：面神经炎的治疗方法"}]
     * message : 查询成功
     * status : 0000
     */

    private String message;
    private String status;
    private List<ResultBean> result;

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public List<ResultBean> getResult() {
        return result;
    }

    public void setResult(List<ResultBean> result) {
        this.result = result;
    }

    public static class ResultBean {
        /**
         * amount : 10
         * detail : 初期，起病缓慢者膝关节疼痛不严重，有可持续性隐痛，气温降低时疼痛加重，与气候变化有关，晨起后开始活动，长时间行走，剧烈运动或久坐起立开始走时膝关节疼痛僵硬，稍活动后好转，上、下楼困难，下楼时膝关节发软，易摔倒。蹲起时疼痛，僵硬，严重时，关节酸痛胀痛,跛行走，合并风湿病者关节红肿，畸形，功能受限，伸屈活动有弹响声，部分患者可见关节积液，局部有明显肿胀、压缩现象
         * releaseTime : 1556985600000
         * sickCircleId : 7
         * title : 急寻：面神经炎的治疗方法
         */

        private int amount;
        private String detail;
        private long releaseTime;
        private int sickCircleId;
        private String title;

        public int getAmount() {
            return amount;
        }

        public void setAmount(int amount) {
            this.amount = amount;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }

        public long getReleaseTime() {
            return releaseTime;
        }

        public void setReleaseTime(long releaseTime) {
            this.releaseTime = releaseTime;
        }

        public int getSickCircleId() {
            return sickCircleId;
        }

        public void setSickCircleId(int sickCircleId) {
            this.sickCircleId = sickCircleId;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }
    }
}
